app/views/jobs/index.xls.erb

        <Cell><Data ss:Type="String"><%= job.description %></Data></Cell>
        <Cell><Data ss:Type="Number"><%= job.candidates_jobs.count %></Data></Cell>
---
SELECT COUNT(*) FROM "candidates" INNER JOIN "candidates_jobs" ON "candidates"."id" = "candidates_jobs"."candidate_id" WHERE "candidates_jobs"."job_id" = $1  [["job_id", 1]]
SELECT COUNT(*) FROM "candidates_jobs" WHERE "candidates_jobs"."job_id" = $1  [["job_id", 1]]