app/views/home/_org_user.html.erb

          <td><%= job.organization.name %></td>
          <td><%= job.candidates_jobs.count %></td>
---
SELECT COUNT(*) FROM "candidates" INNER JOIN "candidates_jobs" ON "candidates"."id" = "candidates_jobs"."candidate_id" WHERE "candidates_jobs"."job_id" = $1  [["job_id", 1]]
SELECT COUNT(*) FROM "candidates_jobs" WHERE "candidates_jobs"."job_id" = ?  [["job_id", 1]]