app/views/candidates/index.html.erb

SELECT "candidates".* FROM "candidates" INNER JOIN "candidates_jobs" ON "candidates"."id" = "candidates_jobs"."candidate_id" WHERE "candidates_jobs"."job_id" = $1  [["job_id", 1]]
SELECT  "invitations".* FROM "invitations" WHERE "invitations"."candidate_id" = $1 AND "invitations"."job_id" = $2 ORDER BY "invitations"."id" DESC LIMIT $3  [["candidate_id", 1], ["job_id", 1], ["LIMIT", 1]]
---
    <% @jobs.each do |job| %>
      <% job.candidates.each do |candidate| %>
        <tr>
          <%invitation = candidate.invitations.where(:job_id => job.id).last%>

SELECT  "candidates_jobs".* FROM "candidates_jobs" WHERE "candidates_jobs"."candidate_id" = $1 AND "candidates_jobs"."job_id" = $2 ORDER BY "candidates_jobs"."id" ASC LIMIT $3  [["candidate_id", 1], ["job_id", 1], ["LIMIT", 1]]
SELECT "invitations".* FROM "invitations" WHERE "invitations"."candidate_id" = $1  [["candidate_id", 1]]
---
          <td><%= job.title %></td>
          <td><%= candidate.candidates_jobs.where(:job_id => job.id).first.created_at %></td>
          <td><%=invitation.present? ? "Invitations sent" : "Invitations not sent"%></td>