app/views/candidate/index.html.erb

SELECT "candidates".* FROM "candidates" INNER JOIN "candidates_jobs" ON "candidates"."id" = "candidates_jobs"."candidate_id" WHERE "candidates_jobs"."job_id" = ?  [["job_id", 1]]
SELECT  "invitations".* FROM "invitations" WHERE "invitations"."candidate_id" = ? AND "invitations"."job_id" = ? ORDER BY "invitations"."id" DESC LIMIT ?  [["candidate_id", 1], ["job_id", 1], ["LIMIT", 1]]
---
    <% @jobs.each do |job| %>
      <% job.candidates.each do |candidate| %>
        <tr>
          <%invitation = candidate.invitations.where(:job_id => job.id).last%>

SELECT  "candidates_jobs".* FROM "candidates_jobs" WHERE "candidates_jobs"."candidate_id" = ? AND "candidates_jobs"."job_id" = ? ORDER BY "candidates_jobs"."id" ASC LIMIT ?  [["candidate_id", 1], ["job_id", 1], ["LIMIT", 1]]
SELECT "candidates".* FROM "candidates" INNER JOIN "candidates_jobs" ON "candidates"."id" = "candidates_jobs"."candidate_id" WHERE "candidates_jobs"."job_id" = $1  [["job_id", 1]]
---
          <td><%= job.title %></td>
          <td><%= candidate.candidates_jobs.where(:job_id => job.id).first.created_at %></td>