app/controllers/candidate_controller.rb

SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "invitations" ("candidate_id", "job_id", "organization_id", "interview_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["candidate_id", 3], ["job_id", 2], ["organization_id", 1], ["interview_date", "2018-08-31 15:30:00"], ["created_at", "2018-08-30 10:06:01.323034"], ["updated_at", "2018-08-30 10:06:01.323034"]]
---
  def send_invitation
    candidate = Candidate.find_by_id(params[:candidate_id])
    job = Job.find_by_id(params[:job_id])
    if candidate.present?
      interview_date = DateTime.strptime(params[:invitation][:interview_date], '%d/%m/%Y - %H:%M') # params[:candidate][:interview_date]
      invitation = Invitation.create(:candidate_id => candidate.id, :organization_id => current_user.organization.id, :job_id => params[:job_id], :interview_date => interview_date)