app/controllers/candidate_controller.rb

  def invite
    candidate = Candidate.find_by_id(params[:id])
---
SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]