app/controllers/candidates_controller.rb

  def index
    @jobs = current_user.organization.jobs.includes({:candidates => :invitations})
---
SELECT  "invitations".* FROM "invitations" WHERE "invitations"."candidate_id" = $1 AND "invitations"."job_id" = $2 ORDER BY "invitations"."id" DESC LIMIT $3  [["candidate_id", 1], ["job_id", 1], ["LIMIT", 1]]
SELECT "candidates".* FROM "candidates" INNER JOIN "candidates_jobs" ON "candidates"."id" = "candidates_jobs"."candidate_id" WHERE "candidates_jobs"."job_id" = $1  [["job_id", 1]]
SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    job = Job.find_by_id(params[:job_id])
    if job.present?
      @candidate = Candidate.find_by_email(params[:candidate][:email])
      p @candidate

      # checking candidate is new or not.
      if @candidate.present?
        # checking candidate already applied to the job or not.
        if @candidate.jobs.where(:id => job.id).first.present?
          respond_to do |format|
            format.html { redirect_to root_path, alert: "You have already applied to this job." }
            format.json { head :no_content }
          end
          return
        end
      else
        @candidate = Candidate.create(candidate_params)
      end
      CandidatesJob.create(:candidate_id => @candidate.id, :job_id => job.id)
---
SELECT  "candidates".* FROM "candidates" WHERE "candidates"."email" = $1 LIMIT $2  [["email", "kishanptl.kp@gmail.com"], ["LIMIT", 1]]
SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "candidates" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "kishan"], ["email", "kishanptl.kp@gmail.com"], ["created_at", "2018-09-02 09:46:04.341575"], ["updated_at", "2018-09-02 09:46:04.341575"]]
INSERT INTO "candidates_jobs" ("candidate_id", "job_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["candidate_id", 1], ["job_id", 1], ["created_at", "2018-09-02 09:46:04.527122"], ["updated_at", "2018-09-02 09:46:04.527122"]]

  def send_invitation
    candidate = Candidate.find_by_id(params[:candidate_id])
    job = Job.find_by_id(params[:job_id])
    if candidate.present?
      interview_date = DateTime.strptime(params[:invitation][:interview_date], '%d/%m/%Y - %H:%M') # params[:candidate][:interview_date]
      invitation = Invitation.create(:candidate_id => candidate.id, :organization_id => current_user.organization.id, :job_id => params[:job_id], :interview_date => interview_date)
---
SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "invitations" ("candidate_id", "job_id", "organization_id", "interview_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["candidate_id", 1], ["job_id", 1], ["organization_id", 1], ["interview_date", "2018-09-29 16:30:00"], ["created_at", "2018-09-02 11:00:11.934398"], ["updated_at", "2018-09-02 11:00:11.934398"]]