app/controllers/home_controller.rb

  def create_candidate
    job = Job.find_by_id(params[:job_id])
    if job.present?
      @candidate = Candidate.find_by_email(params[:candidate][:email])
      p @candidate

      # checking candidate is new or not.
      if @candidate.present?
        # checking candidate already applied to the job or not.
        if @candidate.jobs.where(:id => job.id).first.present?
          respond_to do |format|
            format.html { redirect_to root_path, alert: "You have already applied to this job." }
            format.json { head :no_content }
          end
          return
        end
      else
        @candidate = Candidate.create(candidate_params)
      end
      CandidatesJob.create(:candidate_id => @candidate.id, :job_id => job.id)
---
SELECT  "candidates".* FROM "candidates" WHERE "candidates"."email" = ? LIMIT ?  [["email", "kishan@test.com"], ["LIMIT", 1]]
SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "candidates" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Kishan"], ["email", "kishan@test.com"], ["created_at", "2018-08-30 09:36:12.446738"], ["updated_at", "2018-08-30 09:36:12.446738"]]
INSERT INTO "candidates_jobs" ("candidate_id", "job_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["candidate_id", 1], ["job_id", 2], ["created_at", "2018-08-30 09:36:12.482502"], ["updated_at", "2018-08-30 09:36:12.482502"]]

  def accept_invitation
    invitation = Invitation.find_by_id(params[:id])
    if invitation.present?
      invitation.update_attribute :is_accepted, true
---
SELECT  "invitations".* FROM "invitations" WHERE "invitations"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "invitations" SET "is_accepted" = ?, "updated_at" = ? WHERE "invitations"."id" = ?  [["is_accepted", 1], ["updated_at", "2018-08-29 13:21:57.576499"], ["id", 10]]

  def reject_invitation
    @invitation = Invitation.find_by_id(params[:id])
---
SELECT  "invitations".* FROM "invitations" WHERE "invitations"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]

  def reject_job
    invitation = Invitation.find_by_id(params[:id])
    if invitation.present?
      invitation.update_attributes(:is_accepted => false, :rejected_reason => params[:invitation][:rejected_reason])
---
SELECT  "invitations".* FROM "invitations" WHERE "invitations"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "invitations" SET "is_accepted" = ?, "rejected_reason" = ?, "updated_at" = ? WHERE "invitations"."id" = ?  [["is_accepted", 0], ["rejected_reason", "not interested"], ["updated_at", "2018-08-29 13:35:35.672268"], ["id", 10]]