app/controllers/invitations_controller.rb

SELECT  "invitations".* FROM "invitations" WHERE "invitations"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "invitations" SET "is_accepted" = $1, "updated_at" = $2 WHERE "invitations"."id" = $3  [["is_accepted", true], ["updated_at", "2018-09-02 11:05:00.697292"], ["id", 4]]
---
   def accept
    invitation = Invitation.find_by_id(params[:id])
    if invitation.present?
      invitation.update_attribute :is_accepted, true

SELECT  "invitations".* FROM "invitations" WHERE "invitations"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def reject
    @invitation = Invitation.find_by_id(params[:id])

SELECT  "invitations".* FROM "invitations" WHERE "invitations"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "invitations" SET "is_accepted" = $1, "rejected_reason" = $2, "updated_at" = $3 WHERE "invitations"."id" = $4  [["is_accepted", false], ["rejected_reason", "test reason"], ["updated_at", "2018-09-02 11:05:30.712026"], ["id", 4]]
---
  def reject_job
    invitation = Invitation.find_by_id(params[:id])
    if invitation.present?
      invitation.update_attributes(:is_accepted => false, :rejected_reason => params[:invitation][:rejected_reason])