app/controllers/users/registrations_controller.rb

  def create
    organization = Organization.where(:name => params[:user][:organization]).first
    if organization.present?
      flash[:alert] = "Organization already exists, Please try another one."
      redirect_to request.referrer
      return
    end
    org = Organization.create(:name => params[:user][:organization])
    params[:user][:organization_id] = org.id
    begin
      User.create(
        :email => params[:user],
        :password => params[:password],
        :organization_id => params[:organization_id],
      )
---
SELECT  "organizations".* FROM "organizations" WHERE "organizations"."name" = ? ORDER BY "organizations"."id" ASC LIMIT ?  [["name", "test"], ["LIMIT", 1]]
SELECT  "organizations".* FROM "organizations" WHERE "organizations"."name" = ? LIMIT ?  [["name", "test"], ["LIMIT", 1]]
SELECT  1 AS one FROM "organizations" WHERE "organizations"."name" = ? LIMIT ?  [["name", "test1"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "organization_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "organizations" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "test"], ["created_at", "2018-08-28 07:14:27.366823"], ["updated_at", "2018-08-28 07:14:27.366823"]]